In [1]:
import pandas as pd

У вас есть DataFrame со списком сотрудников и их должностями. Ваша цель — найти всех сотрудников, чья должность начинается со слова "Менеджер".

In [9]:
employees = pd.DataFrame({
    'Имя': ['Алексей', 'Мария', 'Иван', 'Елена', 'Сергей'],
    'Должность': ['Менеджер по продажам', 'Специалист', 'Менеджер проекта', 'Аналитик', 'Старший менеджер']
})

In [10]:
employees

       Имя             Должность
0  Алексей  Менеджер по продажам
1    Мария            Специалист
2     Иван      Менеджер проекта
3    Елена              Аналитик
4   Сергей      Старший менеджер

In [11]:
employees[employees['Должность'].str.match('^Менеджер')]

       Имя             Должность
0  Алексей  Менеджер по продажам
2     Иван      Менеджер проекта

Используя pandas, вам необходимо выбрать из списка товаров те, цена которых начинается с цифры "2".

In [14]:
products = pd.DataFrame({
    'Товар': ['Ноутбук', 'Монитор', 'Клавиатура', 'Мышь', 'Внешний диск'],
    'Цена': ['25000', '12000', '2500', '1500', '2000']
})

print(products)

          Товар   Цена
0       Ноутбук  25000
1       Монитор  12000
2    Клавиатура   2500
3          Мышь   1500
4  Внешний диск   2000

In [18]:
products[products['Цена'].str.match(r'2')]

          Товар   Цена
0       Ноутбук  25000
2    Клавиатура   2500
4  Внешний диск   2000

Вам нужно найти всех сотрудников, чья должность содержит в себе слово "менеджер" (в любом регистре) и при этом не является "Старший менеджер".

In [19]:
employees = pd.DataFrame({
    'Имя': ['Алексей', 'Мария', 'Иван', 'Елена', 'Сергей'],
    'Должность': ['Менеджер по продажам', 'Специалист', 'Менеджер проекта', 'Аналитик', 'Старший менеджер']
})

print(employees)

       Имя             Должность
0  Алексей  Менеджер по продажам
1    Мария            Специалист
2     Иван      Менеджер проекта
3    Елена              Аналитик
4   Сергей      Старший менеджер

In [22]:
employees[employees['Должность'].str.match(r"[^'Старший менеджер']*['менеджер']")]

       Имя             Должность
0  Алексей  Менеджер по продажам
2     Иван      Менеджер проекта
3    Елена              Аналитик